RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_flash_srom.h
/***************************************************************************//**
* \file cy_flash_srom.h
* \version 3.70
*
* \brief
* Provides declaration of API controlling the SROM APIs.
*
********************************************************************************
* \copyright
* Copyright 2021, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

/* This driver is created by referring SROM BROS (002-03298) rev 0W. */
/* Please note SROM API is subject to update in the future. */

#if !defined(CY_FLAH_SROM_H)
#define CY_FLAH_SROM_H
#include "cy_device.h"
#if defined (CY_IP_M7CPUSS)
#include "cy_syslib.h"
#include "cy_ipc_drv.h"
#include "cy_sysint.h"

/** \cond INTERNAL */
typedef void (*cy_srom_handler)(void);

#define CY_SROM_DR_IPC_NOTIFY_STRUCT (0x1UL)
#define CY_SROM_DR_IPC_INTR_STRUCT   (0x2UL)
#define CY_SROM_DR_IPC_INTR_NO       (cpuss_interrupts_ipc_2_IRQn)

typedef enum
{
    CY_SROM_OP_SILICON_ID            = (0x00UL),
    CY_SROM_OP_READ_FUSE_BYTE        = (0x03UL),
    CY_SROM_OP_READ_UNIQUE_ID        = (0x1FUL),
    CY_SROM_OP_SWITCH_REGULATOR      = (0x11UL),
    CY_SROM_OP_CONFIGURE_REGULATOR   = (0x15UL),
    CY_SROM_OP_FLASH_PROGRAM_ROW     = (0x06UL),
    CY_SROM_OP_FLASH_CHECKSUM        = (0x0BUL),
    CY_SROM_OP_FLASH_HASH            = (0x0DUL),
    CY_SROM_OP_FLASH_ERASE_ALL       = (0x0AUL),
    CY_SROM_OP_FLASH_ERASE_SECTOR    = (0x14UL),
    CY_SROM_OP_FLASH_FM_STATUS       = (0x07UL),
    CY_SROM_OP_FLASH_FM_INTR         = (0x08UL),
    CY_SROM_OP_FLASH_ERASE_SUSPEND   = (0x22UL),
    CY_SROM_OP_FLASH_ERASE_RESUME    = (0x23UL),
    CY_SROM_OP_FLASH_BLANK_CHECK     = (0x2AUL),
    CY_SROM_OP_FLASH_PROGRAM_WFLASH  = (0x30UL),
} cy_en_srom_api_opcode_t;

typedef enum
{
    CY_SROM_STATUS_SUCCESS                             = (0x00000000UL), // SROM PASS. Note this is driver specific value.
    CY_SROM_STATUS_INVALID                             = (0x0FFFFFFFUL), // Status Value invalid. Note this is driver specific value.
    CY_SROM_STATUS_INVALID_PROTECTION                  = (int32_t)(0xF0000001UL), // Invalid Protection state. This API is not available in current protection state.
    CY_SROM_STATUS_INVALID_FUSE_ADDR                   = (int32_t)(0xF0000002UL), // Invalid efuse address.This status is returned when BlowFuseBit is called on out-of-bound eFuse.
    CY_SROM_STATUS_INVALID_FM_PL                       = (int32_t)(0xF0000003UL), // Invalid FLASH page latch address
    CY_SROM_STATUS_INVALID_FLASH_ADDR                  = (int32_t)(0xF0000004UL), // Wrong or out of bound FLASH address
    CY_SROM_STATUS_NVM_PROTECTED                       = (int32_t)(0xF0000005UL), // Non-Volatile Memory(FLASH or eFuse) bytes are read/write protected via protection units.Previously called as STATUS_ROW_PROTECTED.
    CY_SROM_STATUS_INVALID_IPC_STRUCT                  = (int32_t)(0xF0000006UL), // Client did not use its reserved IPC structure for invoking system call.
    CY_SROM_STATUS_ADDR_PROTECTED                      = (int32_t)(0xF0000008UL), // Returned by all APIs when client doesn't have access to region it is using for passing arguments.
    CY_SROM_STAUTS_CHECKSUM_NON_ZERO                   = (int32_t)(0xF000000AUL), // Checksum of FLASH resulted in non-zero
    CY_SROM_STATUS_INVALID_OPCODE                      = (int32_t)(0xF000000BUL), // The opcode is not a valid API opcode.
    CY_SROM_STATUS_INVALID_ADDR_RANGE                  = (int32_t)(0xF000000EUL), // Returned when ConfigureRegionBulk is called with start address greater than end address or EraseAll called in dual bank mode for SONOS.
    CY_SROM_STATUS_INVALID_ARGUMENTS                   = (int32_t)(0xF000000FUL), // Returned when invalid arguments are passed to the API. For e.g calling Silicon ID API with ID type of 0x5.
    CY_SROM_STATUS_BOOT_FLASH_AUTH_FAIL                = (int32_t)(0xF0000010UL), // HASH stored in efuse does not match to computed HASH
    CY_SROM_STATUS_TEST_KEY_DFT_EN                     = (int32_t)(0xF0000011UL), // Indicates that TEST_KEY_DFT_EN was set during boot up
    CY_SROM_STATUS_TEST_KEY_SAFE_MODE                  = (int32_t)(0xF0000012UL), // Indicates that TST_KEY_SAFE_MODE was set during boot up
    CY_SROM_STATUS_INVALID_ARGUMENT_LOCATION           = (int32_t)(0xF0000013UL), // User has provided arguments in region other than available user SRAM or not 32-bit
    CY_SROM_STATUS_NON_NMI_ENTRY                       = (int32_t)(0xF0000014UL), // NMI Handler function was executed under non-NMI mode.
    CY_SROM_STATUS_INVALID_TRIM_LEN                    = (int32_t)(0xF0000015UL), // General trims length was found to be less than 2
    CY_SROM_STATUS_INVALID_HASH_ZEROS                  = (int32_t)(0xF0000017UL), // Number of zeros in the HASH computed by ROM boot & number of zeros stored in eFuse don't match.
    CY_SROM_STATUS_INVALID_TOC1                        = (int32_t)(0xF0000018UL), // Table of contents 1fs CRC check failed or /and magic number is not present
    CY_SROM_STATUS_CM4_NOT_IN_DEEPSLEEP                = (int32_t)(0xF0000019UL), // CM4 only reset requested by SoftReset when CM4 is not in deepsleep.
    CY_SROM_STATUS_ALT_FLASH_BOOT_AUTH_FAIL            = (int32_t)(0xF000001AUL), // Returned during secure boot if SFLASH bank 1 authentication check fails.
    CY_SROM_STATUS_INVALID_TOC2                        = (int32_t)(0xF0000020UL), // Table of contents2fs CRC check failed or /and magic number is not present
    CY_SROM_STATUS_SR_ILLEGAL_OP                       = (int32_t)(0xF0000021UL), // Bulk operation requested on SFLASH region.
    CY_SROM_STATUS_OPERATION_NOT_ALLOWED               = (int32_t)(0xF0000022UL), // Returned when flash embedded operations are invoked during margin mode operation.
    CY_SROM_STATUS_MM_ERROR                            = (int32_t)(0xF0000030UL), // Returned by FlashMarginScreenArray SROM API when there is a margin mode failure
    CY_SROM_STATUS_INVALID_CY_ASSET_HASH               = (int32_t)(0xF0000053UL), // Calculated CY_ASSET_HASH doesn't match to the one stored in efuse unused 0xF0000054
    CY_SROM_STATUS_ENABLE_FB_CHECK_BIT_NOT_BLOWN       = (int32_t)(0xF0000055UL), // Returned by TransitionToSecure if he ENABLE_FB_CHECK_IN_NORMAL_is not blown
    CY_SROM_STATUS_CY_ASSET_HASH_MAX_OBJECTS           = (int32_t)(0xF0000056UL), // If the number of the CY_ASSET_HASH exceeds maximum value
    CY_SROM_STATUS_INVALID_FB_CHECK_EFUSE              = (int32_t)(0xF00000ACUL), // The ENABLE_FB_CHECK_IN_NORMAL fuse is corrupted
    CY_SROM_STATUS_CALIBRATE_FAILED                    = (int32_t)(0xF0000080UL), // FLASH trim hunt failed for SONOS. For eCT magic number was not found in TOC1
    CY_SROM_STATUS_TURBON_FAILED                       = (int32_t)(0xF0000081UL), // turbo is low during  FmCalibrate
    CY_SROM_STATUS_ISOLATED_FAILED                     = (int32_t)(0xF0000082UL), // Isolate is high during FmCalibrate
    CY_SROM_STATUS_ERROR_CORRECTION_FAILED             = (int32_t)(0xF0000086UL), // FLASH APIfs were not able to retrieve majority data when fetching HV parameters
    CY_SROM_STATUS_SECTOR_SUSPEND                      = (int32_t)(0xF0000091UL), // Returned when Program operation is called on sector which is suspended from erase.
    CY_SROM_STATUS_NO_ERASE_SUSPEND                    = (int32_t)(0xF0000092UL), // Returned when EraseResume is called when no sector is suspended from erase.
    CY_SROM_STATUS_API_NOT_APPROVED                    = (int32_t)(0xF0000095UL), // Returned by API when the requested system call is not approved by TEE
    CY_SROM_STATUS_POR_NATIVE                          = (int32_t)(0xF00000A0UL), // Returned when FUR download fails with POR_NATIVE=1.
    CY_SROM_STATUS_FUR_ECC_ERROR                       = (int32_t)(0xF00000A1UL), // Returned when FUR download fails due to ECC error.
    CY_SROM_STATUS_IRAM_ECC_ERROR                      = (int32_t)(0xF00000A2UL), // Returned when IRAM download fails due to ECC error.
    CY_SROM_STATUS_FM_ECC_ERROR                        = (int32_t)(0xF00000A3UL), // Returned when FM fails due to ECC error.
    CY_SROM_STATUS_FLASH_NOT_ERASED                    = (int32_t)(0xF00000A4UL), // Returned when ProgramRow is invoked on unerased cells or blank check fails.
    CY_SROM_STATUS_NO_ERASE_ONGOING                    = (int32_t)(0xF00000A5UL), // Returned by EraseSuspend when called with no ongoing erase operation
    CY_SROM_STATUS_ACTIVE_ERASE                        = (int32_t)(0xF00000A6UL), // Returned by ProgramRow when active erase operation is going on.
    CY_SROM_STATUS_EMB_FAIL                            = (int32_t)(0xF00000A7UL), // Returned by FLASH SROM APIs when the embedded operation fails.
    CY_SROM_STAUTS_INVALID_DATA_WIDTH                  = (int32_t)(0xF00000A8UL), // Returned by ProgramRow API if invalid program width option is provided
    CY_SROM_STATUS_EMB_ACTIVE                          = (int32_t)(0xF00000A9UL), // Returned by WriteRow when invoked during an active embedded operation.
    CY_SROM_STATUS_FLASH_SAFTEY_ENABLED                = (int32_t)(0xF00000AAUL), // Returned by FLASH program/erase APIs when writes are disabled in safety register.
    CY_SROM_STATUS_INVALID_BANK_MODE                   = (int32_t)(0xF00000ABUL), // Returned by WriteRow when invoked in dual bank mode.
    CY_SROM_STATUS_INVALID_NUM_ENTRIES                 = (int32_t)(0xF00000B0UL), // Returned by WriteTOC2 when invalid number of entries are passed
    CY_SROM_STATUS_INVALID_ACCESS_RESTRICTION          = (int32_t)(0xF00000B1UL), // Returned when WriteNormalAccessRestrict is called to restrict less
    CY_SROM_STATUS_INVALID_SFLASH_ADDR                 = (int32_t)(0xF00000B2UL), // Returned when WriteRow is called on invalid SFLASH rows in NORMAL state or TOC/patch entries are not in SFLASH
    CY_SROM_STATUS_INVALID_UID                         = (int32_t)(0xF00000B3UL), // Returned by when invalid Unique ID is passed during RMA
    CY_SROM_STATUS_INVALID_SIGN                        = (int32_t)(0xF00000B4UL), // Returned when invalid signature is found during RMA
    CY_SROM_STATUS_INVALID_FACTORY_HASH                = (int32_t)(0xF00000B5UL), // Returned when FACTORY_HASH1(in NORMAL1) or FACTORY_HASH2(in NORMAL2) does not match
    CY_SROM_STATUS_INVALID_TOC1_HASH_OBJECT            = (int32_t)(0xF00000B8UL), // Returned when more than 30(for PSOC6, 10 for Traveo II) HASH objects are indicated in TOC1
    CY_SROM_STATUS_INVALID_TOC2_HASH_OBJECT            = (int32_t)(0xF00000B9UL), // Returned when more than 30(for PSOC6, 10 for Traveo II) HASH  objects are indicated in TOC2
    CY_SROM_STATUS_INVALID_PUBLIC_KEY                  = (int32_t)(0xF00000BAUL), // Returned by TransitionRMA & OpenRMA when public key structure is invalid
    CY_SROM_STATUS_SFLASH_BACKUP_ERASED                = (int32_t)(0xF00000BBUL), // Returned by Sflash programming APIs when backup sector is in erased state.
    CY_SROM_STATUS_INVALID_PU1_FLASH_WRITE_NR          = (int32_t)(0xF00000BCUL), // Returned during boot when SWPU in SFLASH is more than expected
    CY_SROM_STATUS_INVALID_PU1_FUSE_WRITE_NR           = (int32_t)(0xF00000BDUL), // Returned during boot when SWPU in SFLASH is more than expected
    CY_SROM_STATUS_INVALID_PU1_FUSE_READ_NR            = (int32_t)(0xF00000BEUL), // Returned during boot when SWPU in SFLASH is more than expected
    CY_SROM_STATUS_INVALID_PU2_FLASH_WRITE_NR          = (int32_t)(0xF00000BFUL), // Returned during boot when SWPU in SFLASH is more than expected
    CY_SROM_STATUS_INVALID_PU2_FUSE_WRITE_NR           = (int32_t)(0xF00000C0UL), // Returned during boot when SWPU in SFLASH is more than expected
    CY_SROM_STATUS_INVALID_PU2_FUSE_READ_NR            = (int32_t)(0xF00000C1UL), // Returned during boot when SWPU in SFLASH is more than expected
    CY_SROM_STATUS_INVALID_PU_ID                       = (int32_t)(0xF00000C2UL), // Returned by Read or WriteSWPU API when invalid ID is passed.
    CY_SROM_STATUS_PU_PROTECTED                        = (int32_t)(0xF00000C3UL), // Returned by WriteSWPU API when client doesn't have access to update SWPU
    CY_SROM_STATUS_PU_MISMATCH                         = (int32_t)(0xF00000C4UL), // Returned by WriteSWPU API when client doesn't providing matching SL_ADDR & SL_SIZE.
    CY_SROM_STATUS_PU_READ_ECC_ERROR                   = (int32_t)(0xF00000C5UL), // Returned by ReadSWPU API if ECC error occurred during SRAM read operation.
    CY_SROM_STATUS_PU_REJECTED                         = (int32_t)(0xF00000C6UL), // Returned by Read & WriteSWPU API if the IDfd PU was rejected during boot due to overlap or out-of-order region.
    CY_SROM_STATUS_PENDING_ECC_ERROR                   = (int32_t)(0xF00000C7UL), // Returned by Read & Write SWPU APIs if there was a pending ECC error before performing SWPU operations
    CY_SROM_STATUS_INVALID_LIFECYCLE_FUSE              = (int32_t)(0xF00000C8UL), // Returned during boot if valid lifecycle fuse combinations are not read from eFuse.
    CY_SROM_STATUS_FUSE_PGM_FAILED                     = (int32_t)(0xF00000CBUL), // Returned by BlowFuseBit API when read value from programmed fuse is 0
    CY_SROM_STATUS_ARG_PROTECTED                       = (int32_t)(0xF00000CFUL), // User has provided arguments in protected region.
    CY_SROM_STATUS_EFUSE_BOOTROW_NON_ZERO              = (int32_t)(0xF00000D1UL), // Returned by TransitionToSort() in case if the bootrow is not zero in VIRGIN
    CY_SROM_STATUS_SRAM_REPAIR_FAILED                  = (int32_t)(0xF00000D2UL), // Returned by Boot if SRAM BIHR repair operation fails
    CY_SROM_STATUS_SRAM_REPAIR_FUSE_FAILED             = (int32_t)(0xF00000D3UL), // Returned by Boot if SRAM repair fuse redundancy check fails
    CY_SROM_STATUS_SFLASH_CORRUPTED                    = (int32_t)(0xF00000D5UL), // Returned when SFLASH markers are corrupted during boot.
    CY_SROM_STATUS_MARKER_OVERFLOW                     = (int32_t)(0xF00000D6UL), // Returned by WriteRow when marker overflows by 2^32 times.
    CY_SROM_STATUS_CM7_X_NOT_IN_DEEPSLEEP              = (int32_t)(0xF00000D7UL), // Returned by SoftReset API when CM7 reset is requested with CM7 not being in deepsleep mode.
    CY_SROM_STATUS_INVALID_LIFECYCLE                   = (int32_t)(0xF00000D8UL), // Operation is not supported in this LifeCycle  (TVII products only)
    CY_SROM_STATUS_INVALID_HASH_OBJECT_ADDRESS         = (int32_t)(0xF00000DAUL), // Returned when TOC object StartAddr and EndAddr(TOC Object StartAddr+ TOC Object Size) are out of bound of SFLASH/OTP.
    CY_SROM_STATUS_REGULATOR_MODE_MANUAL               = (int32_t)(0xF00000E0UL), // Regulator is configured for gManualh mode
    CY_SROM_STATUS_REGULATOR_SEQ_BUSY                  = (int32_t)(0xF00000E1UL), // Regulator is currently in transition.
    CY_SROM_STATUS_REGULATOR_ALREADY_ENABLED           = (int32_t)(0xF00000E2UL), // Regulator is already enabled
    CY_SROM_STATUS_REGULATOR_NOT_CONFIGURED            = (int32_t)(0xF00000E3UL), // Regulator is not configured with ConfigureRegulator()
    CY_SROM_STATUS_REGULATOR_WRONG_CONFIGURATION       = (int32_t)(0xF00000E4UL), // Returned by SwitchOverRegulators() in case when the syscall is called with different OpMode parameter then ConfigureRegulator().
    CY_SROM_STATUS_WRITE_DEVICE_KEYS_TRIVIAL_KEY       = (int32_t)(0xF00000E5UL), // -TBD
    CY_SROM_STATUS_WRITE_DEVICE_KEYS_NON_ZERO_KEYS     = (int32_t)(0xF00000E6UL), // - TBD
    CY_SROM_STATUS_WRITE_DEVICE_KEYS_WRONG_LIFE_CYCLE  = (int32_t)(0xF00000E7UL), // - TBD
    CY_SROM_STATUS_WRITE_DEVICE_KEYS_MISMATCHED_KEYS   = (int32_t)(0xF00000E8UL), // - TBD
    CY_SROM_STATUS_WRITE_DEVICE_KEYS_WRONG_EFUSE_ZEROS = (int32_t)(0xF00000E9UL), // - TBD
    CY_SROM_STATUS_WRITE_DEVICE_KEYS_CORRUPTED_P_BITS  = (int32_t)(0xF00000EAUL), // - TBD
    CY_SROM_STATUS_ERROR_SYSCALL0                      = (int32_t)(0xF00000EBUL), // - TBD
    CY_SROM_STATUS_ERROR_SYSCALL1                      = (int32_t)(0xF00000ECUL), // - TBD
    CY_SROM_STATUS_ERROR_SYSCALL2                      = (int32_t)(0xF00000EDUL), // - TBD
    CY_SROM_STATUS_ERROR_SYSCALL3                      = (int32_t)(0xF00000EEUL), // - TBD
    CY_SROM_STATUS_ERROR_SYSCALL4                      = (int32_t)(0xF00000EFUL), // - TBD
    CY_SROM_STATUS_HARDFAULT_BOOT                      = (int32_t)(0xF00000F0UL), // Returned during boot if hard fault occurs during bootup
    CY_SROM_STATUS_HARDFAULT_SYSCALL                   = (int32_t)(0xF00000F1UL), // Returned by system call if hard fault occurs in context of system calls
    CY_SROM_STATUS_INVALID_PROG_PPU_ACCESS             = (int32_t)(0xF4000000UL), // Returned when system call(PC1) doesn't have access to the programmable PPU it uses. The programmable PPU ID is returned in LSB.
    CY_SROM_STATUS_INVALID_FIXED_PPU_ACCESS            = (int32_t)(0xF5000000UL), // Returned when system call(PC1) doesn't have access to the fixed PPU it uses. The fixed PPU ID is returned in LSB.
    CY_SROM_STATUS_BOOTROW_MMIO_MISMATCH               = (int32_t)(0xF6000019UL), // Returned when bootrow fuse and MMIO doesn't match
    CY_SROM_STATUS_BOOTROW_KEY_MISMATCH                = (int32_t)(0xF6000029UL), // Returned when key in the bootrow is not 0x29
    CY_SROM_STATUS_BOOTROW_TRIM_MISMATCH               = (int32_t)(0xF6000039UL), // Returned when trim and trim inverse in bootrow are not equal
    CY_SROM_STATUS_BOOTROW_FUSE_MISMATCH               = (int32_t)(0xF6000049UL), // Returned when lifecycle fuses fail its redundancy check.
    CY_SROM_STATUS_BOOTROW_INVALID_COMB                = (int32_t)(0xF6000059UL), // Returned when invalid lifecycle fuse combinations are blown
    CY_SROM_STATUS_HASH_FAILED                         = (int32_t)(0xF1000000UL), // Hash on SFLASH trims  failed. The computed  hash is ORfd with this status.
    CY_SROM_STATUS_FUSE_ZERO_FAILED                    = (int32_t)(0xF2000000UL), // Number of zeroes stored in efuse does not match to computed number
    CY_SROM_STATUS_BOOT_FAULT_MASK                     = (int32_t)(0xF3000000UL), // Returned during boot in IPC_STRUCT0.DATA1 if fault structure 0 valid bit is set. The LSBs will hold the fault ID information.
    CY_SROM_CY_FB_ERROR_INVALID_APP_SIGN               = (int32_t)(0xF1000100UL), // App signature validation failed.
    CY_SROM_CY_FB_ERROR_INVALID_TOC                    = (int32_t)(0xF1000101UL), // Empty or Invalid TOC
    CY_SROM_CY_FB_ERROR_INVALID_KEY                    = (int32_t)(0xF1000102UL), // Invalid Public Key
    CY_SROM_CY_FB_ERROR_UNREACHABLE                    = (int32_t)(0xF1000103UL), // Unreachable Code
    CY_SROM_CY_FB_ERROR_TOC_DATA_CLOCK                 = (int32_t)(0xF1000104UL), // TOC contains invalid CM0+ clock attribute.
    CY_SROM_CY_FB_ERROR_TOC_DATA_DELAY                 = (int32_t)(0xF1000105UL), // TOC contains invalid listen window delay
    CY_SROM_CY_FB_ERROR_FLL_CONFIG                     = (int32_t)(0xF1000106UL), // FLL configuration failed
    CY_SROM_CY_FB_ERROR_INVALID_APP_DATA               = (int32_t)(0xF1000107UL), // Invalid application structure
} cy_en_srom_api_status_t;

