RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_flash_srom.h
typedef enum
{
    CY_SROM_DR_SUCCEEDED         = 0,
    CY_SROM_DR_IPC_BUSY          = 1,
    CY_SROM_DR_TIMEOUT           = 2,
    CY_SROM_DR_API_ERROR         = 3,
    CY_SROM_DR_API_UNKNOWN       = 4,
    CY_SROM_DR_INVALID_INPUT     = 5,
} cy_en_srom_driver_status_t;

typedef enum
{
    CY_SROM_RESPONSE_SUCCESS = 0,
    CY_SROM_RESPONSE_FAIL    = 1,
    CY_SROM_NOT_RESPONSE     = 2,
} cy_en_srom_response_type_t;


/**********************************/
/*** Silicon ID Data Structures ***/
/**********************************/

/* Request Message */
typedef struct
{
    uint32_t        : 8;
    uint32_t IdType : 8;
    uint32_t        : 8;
    uint32_t Opcode : 8;
} cy_stc_silicon_id_arg0_t;

typedef struct
{
    cy_stc_silicon_id_arg0_t arg0;
    uint32_t                 resv[3];
} cy_stc_silicon_id_args_t;

/* Response Message */
typedef struct
{
    uint32_t FamilyIdLow     : 8;
    uint32_t FamilyIdHigh    : 8;
    uint32_t MinorRevisionID : 4;
    uint32_t MajorRevisionId : 4;
    uint32_t                 : 4;
    uint32_t StatusCode      : 4;
} cy_stc_silicon_id_resp_type0_t;

typedef struct
{
    uint32_t SiliconIdLow    : 8;
    uint32_t SiliconIdHigh   : 8;
    uint32_t ProtectionState : 4;
    uint32_t LifeCycleState  : 4;
    uint32_t                 : 4;
    uint32_t StatusCode      : 4;
} cy_stc_silicon_id_resp_type1_t;

typedef enum
{
    CY_LIFE_CYCLE_STATE_VIRGIN             = 0,
    CY_LIFE_CYCLE_STATE_NORMAL             = 1,
    CY_LIFE_CYCLE_STATE_SEC_W_DBG          = 2,
    CY_LIFE_CYCLE_STATE_SECURE             = 3,
    CY_LIFE_CYCLE_STATE_RMA                = 4,
    CY_LIFE_CYCLE_STATE_SORT               = 5,
    CY_LIFE_CYCLE_STATE_PROVISIONED        = 6,
    CY_LIFE_CYCLE_STATE_NORMAL_PROVISIONED = 7,
    CY_LIFE_CYCLE_STATE_NORMAL_RMA         = 8,
    CY_LIFE_CYCLE_STATE_CORRUPTED          = 9,
} cy_en_life_cycle_state_t;

typedef enum
{
    CY_PROTECTION_STATE_UNKNOWN = 0,
    CY_PROTECTION_STATE_VIRGIN  = 1,
    CY_PROTECTION_STATE_NORMAL  = 2,
    CY_PROTECTION_STATE_SECURE  = 3,
    CY_PROTECTION_STATE_DEAD    = 4,
} cy_en_protection_state_t;

typedef struct
{
    uint32_t SROM_FW_MinorVersion  : 8;
    uint32_t SROM_FW_MajorVersion  : 8;
    uint32_t FlashBootMinorVersion : 8;
    uint32_t FlashBootMajorVersion : 4;
    uint32_t StatusCode            : 4;
} cy_stc_silicon_id_resp_type2_t;

typedef union
{
    uint32_t                       u32;
    cy_stc_silicon_id_resp_type0_t IdType0;
    cy_stc_silicon_id_resp_type1_t IdType1;
    cy_stc_silicon_id_resp_type2_t IdType2;
} cy_un_slicon_id_resp0_t;

typedef struct
{
    cy_un_slicon_id_resp0_t resp0;
    uint32_t                resv[3];
} cy_stc_slicon_id_resps_t;

/**************************************/
/*** Read Unique ID Data Structures ***/
/**************************************/
/* Request Message */
typedef struct
{
    uint32_t        : 24;
    uint32_t Opcode : 8;
} cy_stc_rd_unique_id_arg0_t;

typedef struct
{
    cy_stc_rd_unique_id_arg0_t arg0;
    uint32_t                   resv[3];
} cy_stc_rd_unique_id_args_t;

/* Response Message */
typedef struct
{
    uint32_t ErrorCode  : 24;
    uint32_t            : 4;
    uint32_t StatusCode : 4;
} cy_stc_rd_unique_id_resp0_t;

typedef struct
{
    uint32_t DIE_ID0  : 32;
} cy_stc_rd_unique_id_resp1_t;

typedef struct
{
    uint32_t DIE_ID1  : 32;
} cy_stc_rd_unique_id_resp2_t;

typedef struct
{
    cy_stc_rd_unique_id_resp0_t resp0;
    cy_stc_rd_unique_id_resp1_t resp1;
    cy_stc_rd_unique_id_resp2_t resp2;
    uint32_t                    resp3;
} cy_stc_rd_unique_id_resps_t;

/*********************************/
/*** Read Fuse Byte Structures ***/
/*********************************/
#define CY_SROM_EFUSE_RESERVED_NUM (104)
#define CY_SROM_EFUSE_CUSTOMER_DATA_NUM (24)
typedef struct
{
    uint8_t Reserved[CY_SROM_EFUSE_RESERVED_NUM];
    uint8_t CustomerData[CY_SROM_EFUSE_CUSTOMER_DATA_NUM];
} cy_stc_efuse_byte_map_t;

/* Request Message */
typedef struct
{
    uint32_t           : 8;
    uint32_t eFuseAddr : 16;
    uint32_t Opcode    : 8;
} cy_stc_rd_efuse_byte_arg0_t;

typedef struct
{
    cy_stc_rd_efuse_byte_arg0_t arg0;
    uint32_t                    resv[3];
} cy_stc_rd_efuse_byte_args_t;

/* Response Message */
typedef struct
{
    uint32_t ReadByte   : 8;
    uint32_t            : 20;
    uint32_t StatusCode : 4;
} cy_stc_rd_efuse_byte_resp0_t;

typedef struct
{
    cy_stc_rd_efuse_byte_resp0_t resp0;
    uint32_t                     resv[3];
} cy_stc_rd_efuse_byte_resps_t;



/*********************************************************/
/*** Configure & Switch Over Regulator Data Structures ***/
/*********************************************************/

/** Operation mode of REGHC IP (ignored in case of PMIC IP) */
typedef enum
{
    CY_SROM_REGULATOR_MODE_TRANSISTOR = 0,
    CY_SROM_REGULATOR_MODE_PMIC       = 1,
} cy_en_srom_regulator_mode_t;

/** Target of switching regulators  */
typedef enum
{
    CY_SROM_REGULATOR_SWITCH_TARGET_EXT = 0,
    CY_SROM_REGULATOR_SWITCH_TARGET_INT = 1,
} cy_en_srom_regulator_switch_target_t;

/** Polarity of the PMICs "power good" / "abnormal" status output */
typedef enum
{
    CY_SROM_REGULATOR_STATUS_ABNORMAL_LOW  = 0,
    CY_SROM_REGULATOR_STATUS_ABNORMAL_HIGH = 1,
} cy_en_srom_regulator_status_polarity_t;

/** Polarity of the signal to enable the PMIC */
typedef enum
{
    CY_SROM_REGULATOR_ENABLE_LOW  = 0,
    CY_SROM_REGULATOR_ENABLE_HIGH = 1,
} cy_en_srom_regulator_enable_polarity_t;


/* Request Message */
typedef struct
{
    uint32_t              : 1;
    uint32_t Mode         : 1;
    uint32_t              : 6;
    uint32_t SwitchTarget : 8;
    uint32_t Blocking     : 8;
    uint32_t Opcode       : 8;
} cy_stc_switch_regulator_args_t;


/* Request Message 0 for configure regulator */
typedef struct
{
    uint32_t                         : 1;
    uint32_t Mode                    : 1;
    uint32_t EnablePolarity          : 1;
    uint32_t StatusAbnormalPolarity  : 1;
    uint32_t DeepSleep               : 1;
    uint32_t KeepIntRegEnabled       : 1;
    uint32_t                         : 2;
    uint32_t VoltageAdjust           : 4;
    uint32_t                         : 12;
    uint32_t Opcode                  : 8;
} cy_stc_configure_regulator_args_t;

typedef struct
{
    uint32_t                         : 1;
    uint32_t Mode                    : 1;
    uint32_t EnablePolarity          : 1;
    uint32_t StatusAbnormalPolarity  : 1;
    uint32_t DeepSleep               : 1;
    uint32_t UseLinReg               : 1;
    uint32_t UseRadj                 : 1;
    uint32_t VadjOption              : 1;
    uint32_t VoltageAdjust           : 5;
    uint32_t RAdjust                 : 3;
    uint32_t                         : 8;
    uint32_t Opcode                  : 8;
} cy_stc_configure_regulator2_args_t;

/* Request Message 1 for configure regulator 2 (new api) */
typedef struct
{
    uint32_t WaitCountIn1us : 10; // Wait count in 1us steps after PMIC status ok.
    uint32_t                : 22;
} cy_stc_configure_regulator2_args_2_t;


