RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_flash_srom.h
/* Request Message */
typedef struct
{
    uint32_t        : 8;
    uint32_t option : 8; // options, see \ref cy_en_conf_fm_intr_option_t
    uint32_t        : 8;
    uint32_t opcode : 8; // Opcode = 0x08
} cy_stc_conf_fm_intr_arg0_t;

typedef struct
{
    cy_stc_conf_fm_intr_arg0_t arg0;
    uint32_t                   resv[3];
} cy_stc_conf_fm_intr_args_t;

/* Response Message */
typedef struct
{
    uint32_t status     : 28; // status
    uint32_t statusCode : 4;  // status code
} cy_stc_conf_fm_intr_resp0_t;

typedef struct
{
    cy_stc_conf_fm_intr_resp0_t resp0;
    uint32_t                    resv[3];
} cy_stc_conf_fm_intr_resps_t;

/*********************************/
/*** Flash Checksum Structures ***/
/*********************************/
typedef enum
{
    CY_SROM_CHECKSUM_BANK0     = (0x00UL),
    CY_SROM_CHECKSUM_BANK1     = (0x01UL)
} cy_en_checksum_bank_t;

typedef enum
{
    CY_SROM_CHECKSUM_PAGE     = (0x00UL),
    CY_SROM_CHECKSUM_WHOLE    = (0x01UL)
} cy_en_checksum_scope_t;

typedef enum
{
    CY_SROM_CHECKSUM_MAIN        = (0x00UL),
    CY_SROM_CHECKSUM_WOEK        = (0x01UL),
    CY_SROM_CHECKSUM_SUPERVISORY = (0x02UL)
} cy_en_checksum_region_t;

/* Request Message */
typedef struct
{
    uint32_t        : 7;
    uint32_t bank   : 1;  // see \ref cy_en_checksum_bank_t
    uint32_t row_id : 13; // Row id
    uint32_t whole  : 1;  // see \ref cy_en_checksum_scope_t
    uint32_t region : 2;  // see \ref cy_en_checksum_region_t
    uint32_t opcode : 8;  // Opcode = 0x0B
} stc_checksum_less_than_4M_arg0_t;

typedef struct
{
    uint32_t        : 1;
    uint32_t bank   : 1;  // see \ref cy_en_checksum_bank_t
    uint32_t        : 2;
    uint32_t row_id : 17; // Row id
    uint32_t whole  : 1;  // see \ref cy_en_checksum_scope_t
    uint32_t region : 2;  // see \ref cy_en_checksum_region_t
    uint32_t opcode : 8;  // Opcode = 0x0B
} stc_checksum_arg0_t;

typedef struct
{
    stc_checksum_less_than_4M_arg0_t arg0;
    uint32_t                         resv[3];
} stc_checksum_less_than_4M_args_t;

typedef struct
{
    stc_checksum_arg0_t arg0;
    uint32_t            resv[3];
} stc_checksum_args_t;

/* Response Message */
typedef struct
{
    uint32_t            : 28; // Nothing
    uint32_t statusCode : 4;  // status code
} stc_checksum_resp0_t;

typedef struct
{
    stc_checksum_resp0_t resp0;
    uint32_t             resv[3];
} cy_stc_checksum_resps_t;

/*******************************************/
/*** Flash Compute Basic Hash Structures ***/
/*******************************************/
typedef enum
{
    CY_SROM_COMPUTE_HASH_BASIC  = (0x00UL),
    CY_SROM_COMPUTE_HASH_CRC8   = (0x01UL)
} cy_en_computehash_type_t;

/* Request Message */
typedef struct
{
    uint32_t        : 8;
    uint32_t type   : 8; // see \ref cy_en_computehash_type_t
    uint32_t        : 8;
    uint32_t opcode : 8; // Opecde = 0x0D
} cy_stc_compute_hash_arg0_t;

typedef struct
{
    uint32_t start_addr : 32;
} cy_stc_compute_hash_arg1_t;

typedef struct
{
    uint32_t number_byte : 24; // Number of bytes (0: 1 byte,1: 2 bytes etc.)
    uint32_t             : 8;
} cy_stc_compute_hash_arg2_t;

typedef struct
{
    cy_stc_compute_hash_arg0_t arg0;
    cy_stc_compute_hash_arg1_t arg1;
    cy_stc_compute_hash_arg2_t arg2;
    uint32_t                   resv;
} cy_stc_compute_hash_args_t;

/* Response Message */
typedef struct
{
    uint32_t hash_crc   : 28; // Hash/CRC of the data
    uint32_t statusCode : 4;  // status code
} cy_stc_compute_hash_resp0_t;

typedef struct
{
    cy_stc_compute_hash_resp0_t resp0;
    uint32_t                    resv[3];
} cy_stc_compute_hash_resps_t;

/**************************************/
/*** Flash Erase Suspend Structures ***/
/**************************************/
/* Request Message */
typedef struct
{
    uint32_t rev0   : 24;
    uint32_t opcode : 8; // Opcode = 0x22
} cy_stc_erase_suspend_arg0_t;

typedef struct
{
    cy_stc_erase_suspend_arg0_t arg0;
    uint32_t                    resv[3];
} cy_stc_erase_suspend_args_t;

/* Response Message */
typedef struct
{
    uint32_t errorCode  : 28; // error code
    uint32_t statusCode : 4;  // status code
} cy_stc_erase_suspend_resp0_t;

typedef struct
{
    cy_stc_erase_suspend_resp0_t resp0;
    uint32_t                     resv[3];
} cy_stc_erase_suspend_resps_t;

/*************************************/
/*** Flash Erase Resume Structures ***/
/*************************************/
/* Request Message */
typedef struct
{
    uint32_t rev0     : 8;
    uint32_t blocking : 8; // see \ref cy_en_erase_blocking_t
    uint32_t intrmask : 1; // see \ref cy_en_erase_intrmask_t
    uint32_t          : 7;
    uint32_t opcode   : 8; // Opcode = 0x23
} cy_stc_erase_resume_arg0_t;

typedef struct
{
    cy_stc_erase_resume_arg0_t arg0;
    uint32_t                   resv[3];
} cy_stc_erase_resume_args_t;

/* Response Message */
typedef struct
{
    uint32_t errorCode  : 28; // error code
    uint32_t statusCode : 4;  // status code
} cy_stc_erase_resume_resp0_t;

typedef struct
{
    cy_stc_erase_resume_resp0_t resp0;
    uint32_t                    resv[3];
} cy_stc_erase_resume_resps_t;

/************************************/
/*** Flash Blank Check Structures ***/
/************************************/
/* Request Message */
typedef struct
{
    uint32_t        : 24;
    uint32_t opcode : 8; // Opcode = 0x2A
} cy_stc_blank_check_arg0_t;

typedef struct
{
    uint32_t addrToBeChecked : 32;
} cy_stc_blank_check_arg1_t;

typedef struct
{
    uint32_t numOfWordsToBeChecked : 16; // 0: 1 word, 1: 2 words etc.
    uint32_t                       : 16;
} cy_stc_blank_check_arg2_t;

typedef struct
{
    cy_stc_blank_check_arg0_t arg0;
    cy_stc_blank_check_arg1_t arg1;
    cy_stc_blank_check_arg2_t arg2;
    uint32_t                  resv;
} cy_stc_blank_check_args_t;

/* Response Message */
typedef struct
{
    uint32_t errorCode    : 8;  // error code
    uint32_t failedWordId : 16; // first failed word number
    uint32_t              : 4;
    uint32_t statusCode   : 4;  // status code
} cy_stc_blank_check_resp0_t;

typedef struct
{
    cy_stc_blank_check_resp0_t resp0;
    uint32_t                   resv[3];
} cy_stc_blank_check_resps_t;

/*************************/
/*** Generic Structure ***/
/*************************/
/* SROM API argument union 1 */
typedef union
{
    uint32_t                           arg[4];
    cy_stc_silicon_id_args_t           SiId;
    cy_stc_rd_unique_id_args_t         RdUnId;
    cy_stc_rd_efuse_byte_args_t        RdFuse;
    cy_stc_switch_regulator_args_t     SwitchRegulator;
    cy_stc_configure_regulator_args_t  ConfigureRegulator;
    cy_stc_configure_regulator2_args_t ConfigureRegulator2;
    cy_stc_program_row_args_t          ProgramRow;
    cy_stc_erase_sector_args_t         EraseSector;
    cy_stc_erase_all_args_t            EraseAll;
    cy_stc_check_fm_status_args_t      CheckFmStatus;
    cy_stc_conf_fm_intr_args_t         ConfigFmIntr;
    stc_checksum_less_than_4M_args_t   CheckSumLessThan4M;
    stc_checksum_args_t                CheckSum;
    cy_stc_compute_hash_args_t         ComputeHash;
    cy_stc_erase_suspend_args_t        EraseSuspend;
    cy_stc_erase_resume_args_t         EraseResume;
    cy_stc_blank_check_args_t          BlankCheck;
} un_srom_api_args_t;

/* SROM API argument union 2 */
typedef union
{
    uint32_t                             arg[4];
    cy_stc_configure_regulator2_args_2_t ConfigureRegulator2;
} un_srom_api_args_2_t;

/* SROM API response union */
typedef union
{
    uint32_t                       resp[4];
    cy_stc_slicon_id_resps_t       SiId;
    cy_stc_rd_unique_id_resps_t    RdUnId;
    cy_stc_rd_efuse_byte_resps_t   RdFuse;
    cy_stc_program_row_resps_t     ProgramRow;
    cy_stc_erase_sector_resps_t    EraseSector;
    cy_stc_erase_all_resps_t       EraseAll;
    cy_stc_check_fm_status_resps_t CheckFmStatus;
    cy_stc_conf_fm_intr_resps_t    ConfigFmIntr;
    cy_stc_checksum_resps_t        CheckSum;
    cy_stc_compute_hash_resps_t    ComputeHash;
    cy_stc_erase_suspend_resps_t   EraseSuspend;
    cy_stc_erase_resume_resps_t    EraseResume;
    cy_stc_blank_check_resps_t     BlankCheck;
} un_srom_api_resps_t;

typedef union
{
    uint32_t            u32[4];
    un_srom_api_args_t  args;
    un_srom_api_resps_t resps;
} un_srom_api_scrach_sram_t;


/****************************/
/*** Function Declaration ***/
/****************************/
extern cy_en_srom_driver_status_t Cy_Srom_CallApi(const un_srom_api_args_t* params, un_srom_api_resps_t* resp);
extern cy_en_srom_driver_status_t Cy_Srom_CallApi_NonBlock(const un_srom_api_args_t* params);
extern cy_en_srom_driver_status_t Cy_Srom_CallApi_2(const un_srom_api_args_t* params, const un_srom_api_args_2_t* params2, un_srom_api_resps_t* resp);
extern cy_en_srom_driver_status_t Cy_Srom_CallApi_NonBlock_2(const un_srom_api_args_t* params, const un_srom_api_args_2_t* params2);
extern cy_en_srom_response_type_t Cy_Srom_GetResponseType(void);
extern cy_en_srom_api_status_t Cy_Srom_GetApiResponse(un_srom_api_resps_t* resp);
extern cy_en_srom_api_status_t Cy_Srom_ConvertRespToStatus(uint32_t resp0);
extern void Cy_Srom_SetResponseHandler(cy_srom_handler handler);

#endif
/** \endcond */

#endif /* CY_IP_M4CPUSS  CY_IP_M7CPUSS*/
